Repository: MAPSWorks/calculator_pi
Catalog: po/*.po
Languages: es, fi, nl, pt

source: Calculator Plugin for OpenCPN by SaltyPaws aka Walbert Schulpen ======================================= This is a light weight yet powerful calculator plugin for OpenCPN. Would you like to know your hull speed? Key features are: * Storing results in variables * Shows historic calculations * Full complement of nautical functions * Screen footprint can be optimised & minimised as required Adding formulas is easy. If your favorite nautical equation is missing, please let me know your equation via flyspray, and I will add it. Help ========= Type help in the calculator to get these instructions. Examples of expression that work in the calculator are: (comments are in brackets, some results depend on other example calculations): ========= Hull speed: LWL=48 (water line lenght in feet) vhull=1.34*LWL^(1/2) (hull speed in knots) Conversions: ftm=0.3048 (feet to meters) km_to_nm=0.539957 (Kilometers to nautical Mile) ftm*LWL (waterline length in meters) Distance to horizon R=6378.1*1000 (Radius of the earth in m) H=2.5 (Height of the eye above sea-level in m) d = R * acos(R/(R + h)) (Distance to horizon in m) ans*km_to_nm (Distance to horizon in nm) Distance to lighthouse H1=200 (height of lighthouse in m) d1 = R*acos(R/(R + H1)) (Distance to horizon in m) distance=d1+d (visibility range of lighthouse in m) Built-in functions The following table gives an overview of the functions supported by the default implementation. It lists the function names, the number of arguments and a brief description. Name Argc. Explanation sin 1 sine function cos 1 cosine function tan 1 tangens function asin 1 arcus sine function acos 1 arcus cosine function atan 1 arcus tangens function sinh 1 hyperbolic sine function cosh 1 hyperbolic cosine tanh 1 hyperbolic tangens function asinh 1 hyperbolic arcus sine function acosh 1 hyperbolic arcus tangens function atanh 1 hyperbolic arcur tangens function log2 1 logarithm to the base 2 log10 1 logarithm to the base 10 log 1 logarithm to the base 10 ln 1 logarithm to base e (2.71828...) exp 1 e raised to the power of x sqrt 1 square root of a value sign 1 sign function -1 if x<0; 1 if x>0 rint 1 round to nearest integer abs 1 absolute value min var. min of all arguments max var. max of all arguments sum var. sum of all arguments avg var. mean value of all arguments Built-in binary operators The following table lists the default binary operators supported by the parser. Operator Meaning Priority = assignement -1 && logical and 1 || logical or 2 <= less or equal 4 >= greater or equal 4 != not equal 4 == equal 4 > greater than 4 < less than 4 + addition 5 - subtraction 5 * multiplication 6 / division 6 ^ raise x to the power of y 7 *The assignment operator is special since it changes one of its arguments and can only by applied to variables. Other operators muParser has built in support for the if then else operator. It uses lazy evaluation in order to make sure only the necessary branch of the expression is evaluated. Operator Meaning Remarks ?: if then else operator C++ style syntax Variables: pi, e ans is the result of the previous calulation dtr is the conversion factor from degrees to radians you can define your own variables (e.g. myvariable=10/8*cos(dtr*90) or yourvariable=ans) clear removes results in the history, but leaves your defined variables in tact User Interface - type these commands in the command window: history - Toggle the history panel showhelp - Show/Hide the Help button showcalculate - Show/Hide the Calculate button showhistory - Show/Hide the history toggle help - show the help menu Settings/Plugins/Preferences: Show/Hide Calculate, Help and History toggle buttons History Settings: max Results -this is the number of results that will be stored in the history pulldown. The history pulldown will contain five times this value Log to opencpn: Enable/Disable logging of results to opencpn logfile.
es: Plugin Calculator para OpenCPN de SaltyPaws aka Walbert Schulpen ======================================= Este es un Plugin de calculadora para OpenCPN potente y ligero. ¿Quiere conocer cuál es su velocidad de casco? Las principales características que tiene son: * Almacenamiento de resultados en variables * Muestra el historial de cálculos * Complementado con funciones náuticas * La ocupación de la pantalla puede ser optimizada y minimizada como sea necesario Es fácil añadir fórmulas. Si su ecuación náutica favorita no está, por favor envíemela via flyspray, y la añadiré. Ayuda ========= Escriba ayuda en la calculadora para ver estas instrucciones. Ejemplos de expresiones que funcionan en la calculadora son: (los comentarios entre corchetes, algunos resltados dependen de otros cálculos): ========= Velocidad de casco: LWL=48 (eslora longitud de la linea de agua en pies) vhull=1.34*LWL^(1/2) (velocidad en nudos) Conversiones: ftm=0.3048 (pies a metros) km_to_nm=0.539957 (Kilometros a millas náuticas) ftm*LWL (longitud de la línea de agua en metros) Distancia al horizonte R=6378.1*1000 (Radio de la Tierra en metros) H=2.5 (Altura del ojo sobre el nivel del mar en m) d = R * acos(R/(R + h)) (Distancia al horizonte en m) ans*km_to_nm (Distancia al horizonte en NM) Distancia a un faro H1=200 (altura del faro en m) d1 = R*acos(R/(R + H1)) (Distance al horizonte en m) distance=d1+d (Distancia de visibilidad de un faro en m) Built-in functions La tabla siguiente le permite echar un vistazo a las funciones soportadas en la implementación por defecto. Esto lista los nombres de funciones, el número de argumentos y una breve descripción. Nombre Argc. Explicaciones sin 1 seno función cos 1 coseno función tan 1 tangente función asin 1 arco seno función acos 1 aro coseno función atan 1 arco tangente función sinh 1 seno hiperbólico función cosh 1 coseno hiperbólico función tanh 1 tangente hiperbólica función asinh 1 arco seno hiperbólico función acosh 1 arco coseno hiperbólico función atanh 1 arco tangente hiperbólico función log2 1 logaritmo base 2 log10 1 logaritmo base 10 log 1 logaritmo base 10 ln 1 logaritmo base e (2.71828...) exp 1 e elevado a la potencia de x sqrt 1 raiz cuadrada de un valor sign 1 signo función -1 if x<0; 1 if x>0 rint 1 edondear al entero más cercano abs 1 valor absoluto min var. mínimo de todos los argumentos max var. mímo de todos los argumentos sum var. suma de todos los argumentos avg var. valor medio de todos los argumentos Operadores binarios internos La siguiente table muestra los operadores binarios por defecto soportados. Operator Meaning Priority = assignement -1 && logical and 1 || logical or 2 <= less or equal 4 >= greater or equal 4 != not equal 4 == equal 4 > greater than 4 < less than 4 + addition 5 - subtraction 5 * multiplication 6 / division 6 ^ raise x to the power of y 7 *The assignment operator is special since it changes one of its arguments and can only by applied to variables. Other operators muParser has built in support for the if then else operator. It uses lazy evaluation in order to make sure only the necessary branch of the expression is evaluated. Operator Meaning Remarks ?: if then else operator C++ style syntax Variables: pi, e ans is the result of the previous calulation dtr is the conversion factor from degrees to radians you can define your own variables (e.g. myvariable=10/8*cos(dtr*90) or yourvariable=ans) clear removes results in the history, but leaves your defined variables in tact User Interface - type these commands in the command window: history - Toggle the history panel showhelp - Show/Hide the Help button showcalculate - Show/Hide the Calculate button showhistory - Show/Hide the history toggle help - show the help menu Settings/Plugins/Preferences: Show/Hide Calculate, Help and History toggle buttons History Settings: max Results -this is the number of results that will be stored in the history pulldown. The history pulldown will contain five times this value Log to opencpn: Enable/Disable logging of results to opencpn logfile.
fi: Laskin plugin OpenCPN:ään SaltyPawsin Walpert Schulpenilta ======================================= Tämä on kevyt mutta tehokas laskin plugin OpenCPN:ään. Haluatko tietää runkonopeuden? Pääominaisuudet ovat: * Tulosten tallennus muuttujiin * Laskentahistorian näyttö * Täysi navigointifunktioiden vastaavuus * Näytön koko voidaan tarpeen mukaan optimoida & minimoida Kaavojen lisääminen on helppoa. Jos suosikki navigointivastaavuutesi puuttuu, kerrothan siitä minulle flysprayn kautta, niin haluan lisä sen. Ohje Kirjoita help laskimessa, niin saat nämä ohjeet. Esimerkit laskimessa toimivista lausekkeista ovat: (kommentit ovat sulkeissa, jotkin tulokset riippuvat toisista esimerkkilaskuista:) ========= Runkonopeus: LWL=48 (vesilinjan pituus jalkoina) vhull=1.34*LWL^(1/2) (runkonopeus solmuina) Muunnokset: ftm=0.3048 (jalat metriksi) km_to_nm=0.539957 (Kilometrit merimailiksi) ftm*LWL (vesilinja metriksi) Matka horisottiin R=6378.1*1000 (mann säde m) H=2.5 (Silmän korkeus meren pinnasta m) d = R * acos(R/(R + h)) (Matka horisonttiin m) ans*km_to_nm (Matka horisonttiin nm) Matka majakkaan H1=200 (Majakan korkeus m) d1 = R*acos(R/(R + H1)) (Matka horisonttiin m) distance=d1+d (majakan kantama m) Sisäiset funktiot Seuraava taulukko on yleisesitys oletus toteutuksen tukemista funktioista. Se luettelee funktioiden nimet, argumenttien lukumäärän ja lyhyen kuvauksen. Nimi Argc. Selitys sin 1 sini cos 1 cosini tan 1 tangentti asin 1 arcus sini acos 1 arcus cosini atan 1 arcus tangentti sinh 1 hyperbolinen sini cosh 1 hyperbolinen cosini tanh 1 hyperbolic tangentti asinh 1 hyperbolinen arcus sini acosh 1 hyperbolinen arcus tangentti atanh 1 hyperbolinen arcus tangentti log2 1 logaritmi 2 kanta log10 1 logaritmi 10 kanta log 1 logaritmi 10 kanta ln 1 logaritmi e kanta(2.71828...) exp 1 e potenssiin x sqrt 1 neliöjuuri arvosta sign 1 sign funktio -1 jos x<0; 1 jos x>0 rint 1 pyöristys lähimpään kokonaislukuun abs 1 absolutti arvo min var. kaikkien argumenttien min max var. kaikkien argumenttien max sum var. kaikkien argumenttien summa avg var. kaikkien argumenttien keskiarvo Sisäiset binääri operaattorit Seuraava taulukko on yleisesitys oletus jäsentäjän tukemista binääri operaattoreista. Operaattori Tarkoitus Etusija = sijoitus -1 && looginen ja 1 || looginen tai 2 <= vähemmän tai sama 4 >= suurempi tai sama 4 != ei sama 4 == yhtäkuin 4 > suurempi kuin 4 < pienempi kuin 4 + lisäys 5 - vähennys 5 * kertaa 6 / jaetaan 6 ^ \korota x potenssiin y 7 *Sijoitus operaattori erikoinen koska se muuttaa yhden argumenteistaan voidaan liittää vain muuttujiin. Muut operaattorit muParserissa on mukana tuki if then else operaattorille. Se käyttää oikotie arviointia varmistaakseen vain tarpeellisen haaran lausekkeen käsittelyn. Operaattori Tarkoitus Viitteet ?: if then else operaattori C++ tyylinen syntaksi Muuttujat: pi, e ans on edellisen laskutoimituksen tulos dtr on muuntokerroin asteista radiaaneiksi voit määritellä omia muuttujia (esim. munmuuttuja=10/8*cos(dtr*90) tai sunmuuttuja=ans) clear poistaa tulokset historiasta, mutta jättää määrittelemäsi muuttujat koskematta Käyttöliittymä - Anna nämä komennot komentoruudussa: history - Kytke historiataulukko showhelp - Näytä/Piilota Help nappi showcalculate - Näytä/Piilota Laske nappi showhistory - Näytä/Piilota historia vaihtaja help - näytä help menu Asetukset//Pluginit/Etusijat: Näytä/Piilota Laske, Help ja Historia vaihto napit Historia asetukset: max Results -tämä on se lukumäärä tuloksia, jotka näytetään historian näyttöruudussa.Historiatallenne sisältää tämän määrän viisinkertaisena Log to opencpn: Salli/Estä tulosten kirjoittaminen opencpn lokitiedostoon.
pt: Calculadora Plugin para OpenCPN por SaltyPaws aka Walbert Schulpen = = = Isto é um plugin leve e ainda poderosa calculadora para OpenCPN. Gostaria de saber a sua velocidade de casco? Key características são: * armazenar os resultados em variables * mostra histórica dos calculos * Completo complemento de funções Náuticas * pegada de tela pode ser optimizado & minimizado como requiridas Adicionar formulas é fácil. Se sua equação náutica favorita está faltando, por favor, deixe-me saber sua equação através de flyspray, e vou acrescenta-la. Help === Digite Help na calculadora para obter essas instruções. Exemplos de expressões que trabalham na calculadora são: (comentários estão entre colchetes, alguns resultados dependem de outros cálculos de exemplo): === Velocidade do casco: LWL=48 (comprimento da linha de água em pést) vhull=1.34*LWL^(1/2) (Velocidade do casco in nós) Conversões:\ n ftm=0.3048 (pés de ftm*LWL (comprimento da linha d'água em metros) Distancia em metros) km_to_nm=0.539957 (quilômetros para milhas náuticas) para horizon R=6378.1*1000 (raio da terra em d m) H=2.5 (altura do olho acima do nível do mar em m) = R * acos (R /(R + h)) ( (Distancia do horizonte em m) ans*km_to_nm Distância ao horizonte em nm) Distance a lighthouse H1 = 200 d1 (altura do farol em m) = R * acos (R /(R + H1)) (Distancia do horizonte em m) distance=d1+d (visibility range of lighthouse in m) Built-in functions A tabela a seguir fornece uma visão geral das funções suportadas pela implementação padrão. Ela lista os nomes de função, o número de argumentos e uma breve descrição. Name Argc. Explanation sin 1 sine function cos 1 cosine function tan 1 tangens function asin 1 arcus seno function acos 1 arcus cosseno function atan 1 arcus tangens function sinh 1 hyperbolic seno function cosh 1 hyperbolic cosine tanh 1 hyperbolic tangens function asinh 1 hyperbolic arcus seno function acosh 1 hyperbolic arcus tangens function atanh 1 hyperbolic arcur tangens function log2 1 logarithm para o 1 logarithm base 2 log10 para o 1 logarithm base 10 log para a base 10 ln 1 logarithm de base e (2.71828...) exp 1 e elevado à potência de x sqrt 1 square de raiz de uma função de 1 sign de value sign -1, se x < se 0; 1 x > 0 rint 1 round para mais próximo integer abs 1 absolute value min var. min de arguments max var. max todas de todos os arguments sum var. sum de todo arguments avg var. mean o valor de tudo arguments Built em binário operators The tabela a seguir lista os operadores binários padrão suportados pelo analisador de Operator Meaning Priority\. n = assignement -1 && logical e 1 || logical or 2 <= less ou 4 >= greater igual ou igual 4 != not igual 4 == equal 4 > greater do que 4 < less do que 4 + addition 5 - subtraction 5 * multiplication 6 / division 6 ^ \ traise x ao poder do operador de atribuição de 7 *The y é especial desde que muda de um dos seus argumentos e pode somente por aplicado a variáveis. Other operators muParser tem suporte embutido para o se e depois outro operador. Ele usa a avaliação lenta a fim de certificar-se de que apenas o ramo necessário da expressão é avaliado. Operator Meaning Remarks ?: if, em seguida, outro operador C++ estilo syntax Variables: pi, e ans é o resultado da calulation dtr anterior é o fator de conversão de graus para radians you pode definir suas próprias variáveis (por exemplo, myvariable=10/8*cos(dtr*90) ou yourvariable = ans) clear remove resultados na história, mas deixa suas variáveis definidas em tact User Interface - type esses comandos na janela de comando: history - alternar a história panel showhelp - mostrar/ocultar a ajuda button showcalculate - mostrar/ocultar a calcular button showhistory mostrar/ocultar a história toggle help - Visualizar a ajuda menu Settings/Plugins/preferências: Show / esconder calcular, ajuda e história alternar configurações de buttons History: máximo de resultados - este é o número de resultados que serão armazenados em suspenso a história. O pulldown de história irá conter cinco vezes este value Log para opencpn: ativar/desativar log de resultados para o arquivo de log opencpn.

source: DD.dddddd° (no limit to decimals)
es: DD.dddddd° (sin límite de decimales)
fi: DD.dddddd° (ei rajaa desimaaleille)
nl: DD.dddddd° (geen cijferlimiet achter komma)
pt: DD.dddddd° (sem limite de casas decimais)

source: Lattitude
es: Latitud
fi: Leveysaste
nl: Breedte
pt: Latitude

source: Longitude
es: Longitud
fi: Pituuspiiri
nl: Lengte

source: Convert
es: Convertir
fi: Muunna
nl: Converteren
pt: Converter

source: Degrees
es: Grados
fi: Asteet
nl: Graden
pt: Graus

source: N
fi: P

source: S
fi: E
nl: Z

source: E
fi: I
nl: O

source: W
fi: L

source: Degree, Minute
es: Grado, Minuto
fi: Aste, minuutti
nl: graden, minuten
pt: Graus, Minutos

source: DD°MM'SS.s (no limit to digits)
es: DD°MM'SS.s (sin límite de dígitos)
fi: DD°MM'SS.s (ei rajaa numeroille)
nl: DD°MM'SS.s (geen cijferlimiet achter komma)
pt: DD°MM'SS.s (sem limite de dígitos)

source: Select Function Category
es: Seleccione la Categoría de función
fi: Valitse toiminto-luokka
nl: Selecteer functiecategorie
pt: Selecione função categoria

source: Select Function
es: Seleccionar Función
fi: Valitse toiminto
nl: Selecteer functie
pt: Selecionar função

source: Function And Description
es: Función y descripción
fi: Toiminto ja kuvaus
nl: Functie en beschrijving
pt: Função e descrição

source: Description
es: Descripción
fi: Kuvaus
nl: Beschrijving
pt: Descrição

source: Input Parameters
es: Parámetros de entrada
fi: Syöteparametrit
nl: Invoerparameters
pt: Parametros de entrada

source: Parameter
es: Parámetro
fi: Parametri
pt: Parâmetro

source: Function Result Select Units
es: Resultado función seleccionar unidades
fi: Funktion tulos valituissa yksiköissä
nl: Selecteren eenheid functieresultaat
pt: Função resultado selecionar unidades

source: MyLabel
fi: OmaOtsake
nl: MijnLabel
pt: Minha Label

source: Close
es: Cerrar
fi: Sulje
nl: Sluiten
pt: Fechar

source: Lat
nl: Breedtegraad

source: Lon
nl: Lengte
