Repository: MAPSWorks/calculator_pi
Catalog: po/*.po
Languages: es, fi, nl, pt

source: Calculator
es: Calculadora
fi: Laskin
nl: Rekenmachine
pt: Calculadora

source: Functions
es: Funciones
fi: Toiminnnot
nl: Functies
pt: Funções

source: Calculator Plugin
es: Plugin Calculator
fi: Laskin Plugin
nl: Rekenmachine Plugin
pt: Plugin Calculadora

source: This is a light weight yet powerful calculator plugin for OpenCPN. Would you like to know your hull speed?
es: Este es un plugin potente pero poco pesado para OpenCPN. L¿Le gustaría conocer cual es su velocidad de casco?
fi: Se on kevyt mutta tehokas Laskin plugin OpenCPN. Haluatko tietää runkonopeuden?
nl: Dit is een kleine maar krachtige rekenmachine plugin voor OpenCPN. Zou u graag uw romp snelheid willen weten ?
pt: Isto é um peso leve e ainda poderosa calculadora plugin para OpenCPN. você gostaria de saber a sua velocidade de casco?

source: Calculator Preferences
es: Preferencias Calculadora
fi: Laskimen asetukset
nl: Voorkeuren Rekenmachine
pt: Preferências da calculadora

source: Calculator preferences
es: Preferencias Calculadora
fi: Laskimen asetukset
nl: Voorkeuren Rekenmachine
pt: Preferências da calculadora

source: Help!!!!
es: ¡¡¡Ayuda!!!!
fi: Apua!!!!
pt: Ajuda!!!

source: Extra Functions
es: Funciones adicionales
fi: Lisätoimintoja
nl: Extra functies
pt: Funções extras

source: Calculator by SaltyPaws
fi: Laskin SaltyPaws'in tapaan
nl: Rekenmachine PlugIn van SaltyPaws
pt: Calculadora por SaltyPaws

source: All
es: Todo
fi: Kaikki
nl: Alle
pt: Todos

source: Test
es: Prueba
fi: Testi
pt: Testar

source: Mouse
es: Ratón
fi: Hiiri
nl: Muis

source: List
es: Lista
fi: Luettelo
nl: Lijst
pt: Lista

source: Error
fi: Virhe
nl: Fout
pt: Erro

source: clear
es: borrar
fi: tyhjennä
nl: wissen
pt: limpar

source: Clear
es: Borrar
fi: Tyhjennä
nl: Wissen
pt: Limpar

source: CLEAR
es: BORRAR
fi: TYHJENNÄ
nl: WISSEN
pt: Limpar

source: HideHelp
es: OcultaAyuda
fi: PiilotaApu
nl: Verberg Help

source: hidehelp
es: ocultaayuda
fi: piilota apu
nl: verberg help

source: HIDEHELP
es: OCULTAAYUDA
fi: PIILOTA APU
nl: VERBERG HELP

source: ShowHelp
es: MuestraAyuda
fi: NäytäApu
nl: ToonHelp

source: showhelp
es: muestraayuda
fi: näytä apu
nl: toonhelp
pt: mostrarajuda

source: SHOWHELP
es: MUESTRAAYUDA
fi: NÄYTÄ APU
nl: TOONHELP
pt: MOSTRARAJUDA

source: HideHistory
es: OcultaHistoria
fi: PeitäHistoria
nl: VerbergHistorie

source: hidehistory
es: ocultahistoria
fi: peitä historia
nl: verberghistorie

source: HIDEHISTORY
es: OCULTAHISTORIA
fi: PEITÄ HISTORIA
nl: VERBERGHISTORIE

source: ShowHistory
es: MuestraHistoria
fi: NäytäHistoria
nl: ToonHistorie

source: showhistory
es: muestrahistoria
fi: näytä historia
nl: toonhistorie

source: SHOWHISTORY
es: MUESTRAHISTORIA
fi: NÄYTÄ HISTORIA
nl: TOONHISTORIE

source: HideCalculate
es: OcultaCálculos
fi: PeitäLaske
nl: VerbergBerekenen

source: hidecalculate
es: ocultacálculos
fi: peitä laske
nl: verbergberekenen

source: HIDECALCULATE
es: OCULTACÁLCULOS
fi: PEITÄ LASKE
nl: VERBERGBEREKENEN
pt: EsconderCalculo

source: ShowCalculate
es: MuestraCálculos
fi: NäytäLaske
nl: ToonBerekenen
pt: MostrarCalculo

source: showcalculate
es: muestracálculos
fi: näytä laske
nl: toonberekenen
pt: mostrarcalculo

source: SHOWCALCULATE
es: MUESTRACÁLCULOS
fi: NÄYTÄ LASKE
nl: TOONBEREKENEN
pt: MOSTRARCALCULO

source: HideFunction
es: OcultaFunción
fi: PeitäToiminto
nl: VerbergFunktie
pt: EsconderFunção

source: hidefunction
es: ocultafunción
fi: peitä toiminto
nl: verbergfunktie
pt: esconderfunção

source: HIDEFUNCTION
es: OCULTAFUNCIÓN
fi: PEITÄ TOIMINTO
nl: VERBERGFUNKTIE
pt: ESCONDERFUNÇÃO

source: showfunction
es: muestrafunción
fi: näytä toiminto
nl: toonfunktie
pt: mostrarfunção

source: ShowFunction
es: MuestraFunción
fi: NäytäToiminto
nl: ToonFunktie
pt: MostrarFunção

source: SHOWFUNCTION
es: MUESTRAFUNCIÓN
fi: NÄYTÄ TOIMINTO
nl: TOONFUNKTIE

source: Help
es: Ayuda
fi: Ohje
pt: Ajuda

source: HELP
es: AYUDA
fi: APU
pt: Ajuda

source: help
es: Ayuda
fi: apu
pt: ajuda

source: Function
es: Función
fi: Toiminto
nl: Functie
pt: Função

source: function
es: función
fi: toiminto
nl: functie
pt: função

source: FUNCTION
es: FUNCIÓN
fi: TOIMINTO
nl: FUNCTIE
pt: FUNÇÃO

source: history
es: historial
fi: historia
nl: geschiedenis
pt: história

source: History
es: Historial
fi: Historia
nl: Geschiedenis
pt: Historico

source: HISTORY
es: HISTORIAL
fi: HISTORIA
nl: GESCHIEDENIS
pt: HISTÓRICO

source: Calculator INPUT:
es: ENTRADA de calculadora:
fi: Laskin SYÖTTÖ:
nl: Rekenmachine INPUT:
pt: Entrada da Calculadora:

source: Calculator output:
es: Salida de calculadora:
fi: Laskin tuloste:
nl: Rekenresultaat:
pt: Saída da calculadora:

source: Calculate
es: Calcular
fi: Laske
nl: Berekenen
pt: Calcular

source: Calculator Reporting
es: Informe de calculadora
fi: Laskin raportointi
nl: Rekenmachine rapportage
pt: Relatórios da Calculadora

source: Precise (Default)
es: Precisa (por defecto)
fi: Tarkka (oletus)
nl: Nauwkeurig (standaard)
pt: Preciso (padrão)

source: Precise, thousands separator
es: Precisa, separador de millares
fi: Tarkka, tuhaterotin
nl: Nauwkeurig, duizenden scheidingsteken
pt: Precisa, separador de milhares

source: Succinct
es: Sucinta
fi: Suppea
nl: Kort
pt: Sucinto

source: Succinct, thousands separator
es: Sucinta, separador de millares
fi: Suppea, tuhaterotin
nl: Kort, scheidingsteken
pt: Sucinto, separador de milhares

source: Scientific
es: Científica
fi: Tieteellinen
nl: Wetenschappelijk
pt: Científico

source: Humanised
es: Humanizada
fi: Inhimillistetty
nl: Afgestemd
pt: Humanizados

source: Show/Hide Buttons
es: Mostrar/ocultar botones
fi: Näytä/Peitä painikkeet
nl: Toon/Verberg knoppen
pt: Mostrar/ocultar botões

source: Help Button
es: Botón de ayuda
fi: Ohje-painike
nl: Helpknop
pt: Botão de ajuda

source: Show/Hide help button (you can always type "help" from input window).
es: Mostrar/ocultar el botón de ayuda (puede siempre escribir "ayuda" en la ventana de entradas).
fi: Näytä tai Peitä Ohje-painike (voit aina kirjoittaa "help" syöttö-ikkunassa).
nl: Toon/Verberg helpknop (u kunt altijd "help" intikken in het inputvenster).
pt: Mostrar/ocultar botão de ajuda (você pode sempre escrever "ajuda" na janela de entrada).

source: History Toggle
es: Conmutador historial
fi: Historian vaihto
nl: Geschiedenis in-/uitschakelen
pt: Comutar História

source: Show/Hide history toggle (you can always type "history" from input window).
es: Muestra/oculta conmutador historial (puede siempre teclear "historial" en la pantalla de entradas).
fi: Näytä tai Peitä historia vaihto (voit aina kirjoittaa "history" input-ikkunasta).
nl: Toon/Verberg geschiedenisknop (u kunt altijd "history" intikken in het inputvenster).
pt: Mostrar/ocultar interruptor de história (você sempre pode digitar "história" na janela de entrada).

source: History Pulldown
es: Historial desplegable
fi: Historia alasvetovalikko
nl: Geschiedenis pulldown
pt: Baixar Histórico

source: Calculate Button
es: Botón calcular
fi: Laske painike
nl: Berekenknop
pt: Botão Calcular

source: Show/Hide Calculate button (you can always press enter at the end of input).
es: Botón Mostrar/Ocultar Calcular (siempre puede presionar "entrar" al final de la entrada).
fi: Näytä tai Peitä laske painike (voit aina painaa enteriä syötön lopussa).
nl: Toon/Verberg berekenknop (u kunt altijd op ENTER drukken na de input).
pt: Botão Mostrar/ocultar calcular (você sempre pode pressionar enter no final da entrada).

source: Function Button in Calculator window
es: Botón de Función en la pantalla de la calculadora
fi: Toimintonäppäin laskin-ikkunassa
nl: Functieknop in Rekenmachine-scherm
pt: Botão de função na janela da calculadora

source: Function Button in OpenCPN (Requires OpenCPN restart)
es: Botón de función en OpenCPN (requiere reinicio en OpenCPN)
fi: Funktio-painike OpenCPN:ssä (vaatii OpenCPN:n uudelleen käynnistyksen)
nl: Functieknop in OpenCPN (opnieuw opstarten vereist)
pt: Botão de função em OpenCPN (OpenCPN requer reinicialização)

source: History Settings
es: Configuración del Historial
fi: Historian asetukset
nl: Geschiedenisinstellingen
pt: Configurações do Histórico

source: Max Results
es: Max Resultados
fi: Tuloksia enintään
nl: Max. resultaten
pt: Maximos resultados

source: More results use up more memory. Memory is only allocated if required (e.g. if number is 30000, corresponding memory will only be used after this many calculations).
es: Más resultados utilizan más memoria. La memoria se asigna sólo si es necesario (por ejemplo, si el número es 30000, la memoria correspondiente sólo se utilizarán después de tantos cálculos).
fi: Lisää tuloksia käyttää enemmän muistia. Muistia varataan vain tarvittaessa (esim. jos luku on 30000, vastaavaa muistia käytetään ainoastaan näin useaan laskelmaan).
nl: Meer resultaten vereisen meer geheugen. Geheugen wordt slechts toegekend indien nodig (als bijvoorbeeld het getal 30.000 is, zal overeenkomstige geheugen slechts worden gebruikt na dit aantal berekeningen).
pt: Mais resultados usem mais memória. Memória é alocada somente se necessário (por exemplo, se o número é 30000, memória correspondente só será usada depois de tantos cálculos).

source: More results use more memory. Memory will be cleared if Max Results is reached. NB variables are kept
es: Más resultados utilizan más memoria. La memoria se borrará si se alcanza el máximo de resultados. Se mantienen las variables NB
fi: Lisää tuloksia käyttää enemmän muistia. Muisti tyhjennetään, kun Max tuloksiin päästään. NB muuttujat pidetään
nl: Meer resultaten vereisen meer geheugen. Geheugen wordt gewist als 'Max. resultaten' is bereikt. NB variabelen worden bewaard.
pt: Mais Resultados usam mais memória. Memória será apagada se Max Resultados for atingido. Variáveis NB são mantidas

source: Opacity
es: Opacidad
fi: Läpinäkyvyys
nl: Transparantie
pt: Opacidade

source: Show History Window
es: Mostrar ventana de historial
fi: Näytä historiaikkuna
nl: Geschiedenisvenster weergeven
pt: Mostrar janela de histórico

source: Show/Hide history
es: Mostrar/Ocultar Historial
fi: Näytä tai Peitä historia
nl: Toon/Verberg historie
pt: Mostrar/Ocultar Histórico

source: Other
es: Otros
fi: Muut
nl: Overige
pt: Outros

source: Log results to opencpn
es: Registrar resultados en OpenCPN
fi: Loki tulokset opencpn:ään
nl: Resultaten naar OpenCPN
pt: Resultados do log para opencpn

source: Log calculator results in OpenCPN log file
es: Los resultados de los cálculos se registran en el archivo log de OpenCPN
fi: Lokin Laskimen tulokset OpenCPN lokitiedostossa
nl: Noteer resultaten in OpenCPN logbestand
pt: Guardar resultados da calculadora no arquivo de log do OpenCPN
